## Intro To Pandas 

Link to Playlist: https://leetcode.com/studyplan/introduction-to-pandas/

Link to My Personal Data Science Playlist: https://leetcode.com/problem-list/vpqfof2t/

#### 2877: Create a DataFrame from List

In [88]:
import pandas as pd
student_data = [
  [1, 15],
  [2, 11],
  [3, 11],
  [4, 20]
]
df = pd.DataFrame(student_data, columns = ["student_id", "age"])
df

   student_id  age
0           1   15
1           2   11
2           3   11
3           4   20

#### 2878: Get the size of a Dataframe

In [89]:
row,col = df.shape
ans= [row,col]
print(ans)

[4, 2]

#### 2879: Display the First Three Rows

In [90]:
df.head(3)

# or

rows = df[0:3]
print(rows)

   student_id  age
0           1   15
1           2   11
2           3   11

### 2880: Select Data

In [91]:
print(df.loc[df["age"]==11,["student_id"]])

   student_id
1           2
2           3

#### 2881: Create a New Column

In [92]:
df["double age"] = df["age"] * 2
df

   student_id  age  double age
0           1   15          30
1           2   11          22
2           3   11          22
3           4   20          40

#### 2882: Drop Duplicate Rows

In [93]:
df.drop_duplicates(subset="age", inplace=True)
df

   student_id  age  double age
0           1   15          30
1           2   11          22
3           4   20          40

#### 2883: Drop Missing Data

In [94]:
df.dropna(subset='age')

   student_id  age  double age
0           1   15          30
1           2   11          22
3           4   20          40

#### 2884: Modify Columns

In [95]:
df["age"] * 2

0    30
1    22
3    40
Name: age, dtype: int64

#### 2885: Renaming Columns

In [96]:
df.rename(columns={'age':'age_in_years'}, inplace=True)
df

   student_id  age_in_years  double age
0           1            15          30
1           2            11          22
3           4            20          40

#### 2886: Change Data Type

In [97]:
df["age_in_years"] = df["age_in_years"].astype(float)
df

   student_id  age_in_years  double age
0           1          15.0          30
1           2          11.0          22
3           4          20.0          40

#### 2887: Fill Missing Data

In [ ]:
#df["age_in_years"].fillna(0)

#### 2888: Reshape Data: Concatenate

In [ ]:
# df = pd.concat([df1,df2], axis = 0)

#### 2889: Reshape Data: Pivot

In [99]:
# Create a Pandas DataFrame with columns 'Date', 'Category', and 'Value'
import numpy as np
date_rng = pd.date_range(start='2022-01-01', end='2022-01-10', freq='D')
df = pd.DataFrame({'Date': np.random.choice(date_rng, size=20), 'Category': np.random.choice(['A', 'B', 'C'], size=20), 'Value': np.random.randint(1, 100, size=20)})
print("Original DataFrame:")
print(df)

# Create a pivot table to compute the sum of 'Value' for each 'Category' by 'Date'
pivot_table = df.pivot_table(values='Value', index='Date', columns='Category', aggfunc='sum')
print("Pivot Table:")
print(pivot_table)

Original DataFrame:
         Date Category  Value
0  2022-01-03        A      5
1  2022-01-08        B     12
2  2022-01-05        B     66
3  2022-01-01        A     75
4  2022-01-04        C     90
5  2022-01-01        B     46
6  2022-01-08        A     89
7  2022-01-02        A     73
8  2022-01-03        A     34
9  2022-01-08        B     29
10 2022-01-01        C     74
11 2022-01-03        C     11
12 2022-01-10        C     18
13 2022-01-09        A     19
14 2022-01-07        C     63
15 2022-01-04        C     71
16 2022-01-07        C     28
17 2022-01-04        C     66
18 2022-01-08        B     44
19 2022-01-01        A     59
Pivot Table:
Category        A     B      C
Date
2022-01-01  134.0  46.0   74.0
2022-01-02   73.0   NaN    NaN
2022-01-03   39.0   NaN   11.0
2022-01-04    NaN   NaN  227.0
2022-01-05    NaN  66.0    NaN
2022-01-07    NaN   NaN   91.0
2022-01-08   89.0  85.0    NaN
2022-01-09   19.0   NaN    NaN
2022-01-10    NaN   NaN   18.0

#### 2890: Reshape Data: Melt

Intuition

This problem requires us to transform a wide-format sales report (where each quarter is a separate column) into a long format (where quarters become row values). This is the opposite of pivoting - we're "melting" or "unpivoting" the data to make it more suitable for analysis and visualization tools that prefer normalized data structures.

Approach

We'll use pandas' melt() function to:

Keep "product" as an identifier column (id_vars) - it remains unchanged
Transform the quarter columns (quarter_1 through quarter_4) into row values
Create a new "quarter" column containing the quarter names (var_name)
Create a new "sales" column containing the corresponding sales values (value_name)
Convert from wide format (fewer rows, more columns) to long format (more rows, fewer columns)
This transformation makes the data more suitable for time-series analysis and grouping operations.

Complexity

Time complexity: O(n×m)
Where n is the number of products and m is the number of quarters, as we create n×m rows in the output.

Space complexity: O(n×m)
The melted DataFrame will have n×m rows (one for each product-quarter combination).

In [ ]:
# import pandas as pd

# def meltTable(report: pd.DataFrame) -> pd.DataFrame:
#     return report.melt(
#         id_vars=["product"],
#         value_vars=["quarter_1", "quarter_2", "quarter_3", "quarter_4"],
#         var_name="quarter",
#         value_name="sales"
#     )